app/Controllers/adminController.php

    public function tablebasic()
    {
        $session = session();
        $result = $this->db->query('SELECT product.id, product.product_name, product.product_desc, product.product_img, product.product_price ,categories.category_name,product.user_id,product.status,product.created_at FROM `product` JOIN categories ON product.category_id= categories.id');
        $result = $result->getResultArray();
        $categoriesModel = new categoriesModel();
        $productModel = new productModel();
        $category = $categoriesModel->findAll();
---
SELECT *
FROM `categories`