app/Controllers/productController.php

UPDATE `product` SET `product_name` = 'Muffin - Carrot Individual Wrap', `product_desc` = 'Bitten by rat, sequela', `product_img` = 'http://dummyimage.com/125x100.png/cc0000/ffffff', `product_price` = '$9513.76', `category_id` = '10', `status` = 1, `rating` = '3'
WHERE `product`.`id` IN ('47')
---
                    "status" => $status,
                    "rating"=>$rating
                ];
                if ($productModel->update($productid, $data)) {

DELETE FROM `product`
WHERE `id` IN ('1001')
---
    public function deleteProduct($num = null)
    {
            if ($num != null) {
                $userModel = new productModel();
                $delete = [
                    "id" => $num
                ];
                if ($userModel->delete($delete)) {